#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/jujulego/ants/runs/run-oy2rFC68z6NMGLXF

Waiting for the plan to start...

Terraform v1.2.7
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_dynamodb_table.maps-table will be created
  + resource "aws_dynamodb_table" "maps-table" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "mapId"
      + id               = (known after apply)
      + name             = "maps"
      + read_capacity    = 2
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = {
          + "Project" = "ants"
        }
      + write_capacity   = 2

      + attribute {
          + name = "mapId"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = (known after apply)
          + enabled        = (known after apply)
        }
    }

  # aws_dynamodb_table.tiles-table will be created
  + resource "aws_dynamodb_table" "tiles-table" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "blockId"
      + id               = (known after apply)
      + name             = "tiles"
      + range_key        = "blockPosition"
      + read_capacity    = 10
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = {
          + "Project" = "ants"
        }
      + write_capacity   = 10

      + attribute {
          + name = "blockId"
          + type = "S"
        }
      + attribute {
          + name = "blockPosition"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = (known after apply)
          + enabled        = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```

</details>
*Pushed by: @Jujulego, Action: `pull_request`*